com.predic8.membrane.core.tests/resources/jd.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ValidateEmailRequest xmlns="urn:ws-xwebservices-com:XWebEmailValidation:EmailValidation:v2:Messages">
      <Email>dasistemail@gmail.com</Email>
    </ValidateEmailRequest>
  </soap:Body>
  
</soap:Envelope>